backend/app/controllers/api/v1/cocktails_controller.rb

  def index
    # キャッシュキーを生成（パラメータに応じて変化）
    cache_key = "cocktails_index_#{cache_key_params}"

    # キャッシュから取得、なければクエリ実行
    # データは基本的に不変のためキャッシュを長めにする
    result = Rails.cache.fetch(cache_key, expires_in: 12.hours) do
      cocktails = Cocktail.all
---
SELECT "cocktails".* FROM "cocktails"